In [1]:
import pandas as pd

In [3]:
data = {
    "국어": [90, 50, None, 40],
    "수학": [80, None, None,  50]
}
idx = ["가영", "나미", "다윤", "라희"]
dfA = pd.DataFrame(data, index=idx)
dfA

      국어    수학
가영  90.0  80.0
나미  50.0   NaN
다윤   NaN   NaN
라희  40.0  50.0

In [4]:
dfA.isnull().sum()

국어    1
수학    2
dtype: int64

In [6]:
dfB = dfA.dropna()
dfB

      국어    수학
가영  90.0  80.0
라희  40.0  50.0

In [8]:
dfB = dfA.dropna(subset=["국어"])
dfB

      국어    수학
가영  90.0  80.0
나미  50.0   NaN
라희  40.0  50.0

In [9]:
dfB = dfA.fillna(dfA.mean())
dfB

      국어    수학
가영  90.0  80.0
나미  50.0  65.0
다윤  60.0  65.0
라희  40.0  50.0

In [11]:
dfB = dfA.fillna(method='ffill')
dfB

      국어    수학
가영  90.0  80.0
나미  50.0  80.0
다윤  50.0  80.0
라희  40.0  50.0

In [13]:
data = [
    [10, 30, 40],
    [20, 30, 40],
    [20, 30, 40],
    [30, 30, 50],
    [20, 30, 40]
]
dfA = pd.DataFrame(data)
dfA

    0   1   2
0  10  30  40
1  20  30  40
2  20  30  40
3  30  30  50
4  20  30  40

In [16]:
dfA.duplicated().value_counts()

False    3
True     2
Name: count, dtype: int64

In [17]:
dfB = dfA.drop_duplicates()
dfB

    0   1   2
0  10  30  40
1  20  30  40
3  30  30  50

In [18]:
# 문자열형 데이터를 수치로 변환하다
data = {
    "A": ["100", "300"],
    "B": ["500", "1,500"]
}
dfA = pd.DataFrame(data)
dfA

     A      B
0  100    500
1  300  1,500

In [19]:
dfA.dtypes

A    object
B    object
dtype: object

In [20]:
dfA["A"] = dfA["A"].astype(int)
dfA.dtypes

A     int32
B    object
dtype: object

In [ ]:
dfA["B"] = dfA["B"].str.replace(", ", "").astype(int)
dfA.dtypes